curious.org
#+title: Curious Musings
#+options: num:nil toc:nil \n:nil
#+OPTIONS: tex:t
#+todo: TODO(t) CANCELLED(c) |  WIP(w) PUBLISHED(p)
#+hugo_base_dir: .
#+hugo_auto_set_lastmod: %Y-%m-%d
#+MACRO instagram @@html:@@html:@@https:@@https:@@//www.instagram.com/p/$1

:PROPERTIES:
:EXPORT_HUGO_SECTION:
:END:
**** PUBLISHED 9 days of #100DaysToOffload :blogging:writing:emacs:100DaysToOffload:text:
:PROPERTIES:
:EXPORT_FILE_NAME: 2020-05-08
:EXPORT_HUGO_PUBLISHDATE: 2020-05-08
:END:
***** Experiences after 9 days of blogging

About 3 weeks ago I decided to start blogging.  For various still
ill-defined reasons, some of which I explored in a [[https://eludom.github.io/blog/poetry-in-the-trash/][blog post
contemplating the fate of writing and writers great and small]].
But it's still somewhat mushy.

I spent some time coming up the curve on the [[https://gohugo.io/][Hugo framework for
building static web sites]] and the [[https://ox-hugo.scripter.co/][emacs org mode counterpart ox-hugo]]
which let me put up my [[https://eludom.github.io/][Curious Musings]] blog.

The a few days after that on [[https://fosstodon.org/web/timelines/home][Fosstodon]] (open source distributed social
media) I came across the https://100daystooffload.com/ challenge
which, basically encourages you to "just write".   Good timing.
Here it is.

#+hugo: more

I've put out a couple posts that I've put some work into like
this one about [[https://eludom.github.io/blog/2020-05-06/][Awesome online singing from Denmark to Australia, and
social distancing too!]] and [[https://eludom.github.io/blog/steve/][a tribute to Steve Wilhite]] who was my
first mentor and whom some of you know as the creator of GIF (a
very minor output of Steve's total work that just happened to
stick).  Some post have been quick.

***** "Yes, but what if /everyone/ did this"?
Yesterday, also on Fosstodon, Per Gregory@g had this say:

#+begin_quote
"Social media:
Don't use it to impress people, use it to impact people" ~ unknown

I love this, and I'm going to remind myself of it when on social media.
#+end_quote

Wise words.  Basically, "it's not about me" (unless you take the
catharsis or hubris angles I explored earlier).  OK, it /should not/
be all about me.

***** Who is /this/ post for?

So who is /this/ post for and is it useful?  You be the judge.

Maybe you're interested in getting started blogging, or wondering
what software you could use, or where you could find new online
communities that are not monitized by ads, or you want to pay
tribute to someone, or you're interested in organizing online choral
singing, or joining meet-ups of new online communities during social
distancing.  Then this post might be for you.

Day 09 of #100DaysToOffload.





