content/Blog/2020-05-08.md
+++
title = "9 days of #100DaysToOffload"
author = ["George Jones"]
publishDate = 2020-05-08
lastmod = 2020-05-09T09:13:14-04:00
tags = ["blogging", "writing", "emacs", "100DaysToOffload", "text"]
draft = false
+++

## Experiences after 9 days of blogging {#experiences-after-9-days-of-blogging}

About 3 weeks ago I decided to start blogging.  For various still
ill-defined reasons, some of which I explored in a [blog post
contemplating the fate of writing and writers great and small](https://eludom.github.io/blog/poetry-in-the-trash/).
But it's still somewhat mushy.

I spent some time coming up the curve on the [Hugo framework for
building static web sites](https://gohugo.io/) and the [emacs org mode counterpart ox-hugo](https://ox-hugo.scripter.co/)
which let me put up my [Curious Musings](https://eludom.github.io/) blog.

The a few days after that on [Fosstodon](https://fosstodon.org/web/timelines/home) (open source distributed social
media) I came across the <https://100daystooffload.com/> challenge
which, basically encourages you to "just write".   Good timing.
Here it is.

<!--more-->

I've put out a couple posts that I've put some work into like
this one about [Awesome online singing from Denmark to Australia, and
social distancing too!](https://eludom.github.io/blog/2020-05-06/) and [a tribute to Steve Wilhite](https://eludom.github.io/blog/steve/) who was my
first mentor and whom some of you know as the creator of GIF (a
very minor output of Steve's total work that just happened to
stick).  Some post have been quick.


## "Yes, but what if _everyone_ did this"? {#yes-but-what-if-everyone-did-this}

Yesterday, also on Fosstodon, Per Gregory@g had this say:

> "Social media:
> Don't use it to impress people, use it to impact people" ~ unknown
>
> I love this, and I'm going to remind myself of it when on social media.

Wise words.  Basically, "it's not about me" (unless you take the
catharsis or hubris angles I explored earlier).  OK, it _should not_
be all about me.


## Who is _this_ post for? {#who-is-this-post-for}

So who is _this_ post for and is it useful?  You be the judge.

Maybe you're interested in getting started blogging, or wondering
what software you could use, or where you could find new online
communities that are not monitized by ads, or you want to pay
tribute to someone, or you're interested in organizing online choral
singing, or joining meet-ups of new online communities during social
distancing.  Then this post might be for you.

Day 09 of #100DaysToOffload.
